district9prawn/rx72t-canbus-demo/src/demo/can_api_demo.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2015 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : can_api_demo.c
* Description  : CAN API demo. Main application program. See operation below under DEMO DESCRIPTION.

CAN Baudrate: 500 kbps.

Demonstration of CAN receive and transmit using the CAN API.

The demo can be run in three ways:
1.  Program two boards and connect them together over the CAN bus. Swap the CAN ID values TX_CANID_DEMO_INIT and
RX_CANID_DEMO_INIT on one of the boards before programming and running the demo.
2) Set CANPORT_TEST_1_INT_LOOPBACK in the R_CAN_PortSet API to communicate internally, no external bus needed!
3) Use a CAN bus monitor, e.g. SysTec's low-cost monitor 3204000, to send and receive frames to/from the demo.
Remote frames can also be demonstrated if CAN interrupts are enabled. See last paragraph below.

OPERATION:
The demo transmits and receives frames with the default CAN-IDs TX_CANID_DEMO_INIT and RX_CANID_DEMO_INIT.

The demo starts up by sending NR_STARTUP_TEST_FRAMES test frames back-to-back as fast as possible. This has two
purposes. 1) Check the bus link. 2) Demonstrate how messages are sent back-to-back as fast as possible.

User action: Press SW1 to send one CAN frame. To increment the TxID hold SW2 down and press SW3. The actual send
command is invoked by the Sw1Func() function. To change RxID hold SW3 down and press SW2. The demo "action" can best
be seen inside function can_int_demo or can_poll_demo (depending on the setting of USE_CAN_POLL in r_can_rx_config.h).

Remote frames:
The demo will also send remote frame responses if REMOTE_DEMO_ENABLE is set to 1 in can_api_demo.c. The requesting
CAN source must be set to send remote frame requests with CAN-ID 50h (REMOTE_TEST_ID in can_api_demo.h) to to the RX.
The remote frames demo only runs in interrupt mode (USE_CAN_POLL set to 1.
* ************************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 20.02.2015 2.01    For 64M, 71M. Originates from RX63N.
*         : 30.10.2015 2.02    FIT update, new R_CAN_Create interface.
*         : 03.03.2016 2.10    65N added.
*         : 30.01.2017 2.11    - Test run with 65N-2MB.
*                              - Added ERROR_DIAG macro. Use for bus error diagnostics only.
*                              - Removed all USE_LCD code. Using debug console (printf) instead.
*                                Added corresponding trace code to demo.
*                              - Function names changed_to_this_style().
*                              - Cleaned up handle_can_bus_state().
*                              - Some GSCE coding guidelines implemented. Mulitple lines changed. (Plugin was used.)
*         : 04.01.2021 4.10    Updated demo for CAN V4.10.
*         : 01.04.2021 5.00    Updated demo for CAN V5.00.
*         : 20.09.2022 5.40    Updated demo project:
*                              Call R_CAN_Control(ch_nr, OPERATE_CANMODE) before call R_CAN_TxSet() or R_CAN_TxSetXid().
***********************************************************************************************************************/
/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "can_api_demo.h"
#include "platform.h"
#include "r_can_rx_if.h"
#include "r_can_rx_config.h"
#include <stdio.h>


/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
/* TEST CAN ID */
#if (FRAME_ID_MODE == STD_ID_MODE)
    #define     TX_CANID_DEMO_INIT  	(0x0A0)    // Max 0x7FF if Standard ID.
    #define     RX_CANID_DEMO_INIT     	(0x0A1)    // "-
#else
    #define     TX_CANID_DEMO_INIT     	(uint32_t)(0x000A0000)    ///Max 0x20000000 if Extended CAN ID.
    #define     RX_CANID_DEMO_INIT     	(uint32_t)(0x000A0001)    // "-
#endif

#ifdef CAN2 // Three CAN channels exist on device.
    #define     NR_CAN_CHANNELS             (3)
#else
#ifdef CAN1 // Two CAN channels exist.
    #define     NR_CAN_CHANNELS             (2)
#else       // One CAN channel.
    #define     NR_CAN_CHANNELS             (1)
#endif
#endif

#define     NR_STARTUP_TEST_FRAMES      (99)
#define     NR_LOOPS_RESET_LEDS         (0x00020000)
#define     LED_DELAY                   (0x00200000)

#define     REMOTE_DEMO_ENABLE          (0)   /* 1 on, 0 off. */
#define     REMOTE_TEST_ID              (0x050)

/* Declares the baud rate prescaler division and bit timing values for CAN0 */
#define CAN0_BRP   (5)
#define CAN0_SJW   (2)
#define CAN0_TSEG1 (11)
#define CAN0_TSEG2 (8)

/* Use this to aid in diagnose of problematic CAN bus.
 * Do *NOT* use in production unless error diagnostics is desired in end product.
 * Observe that CAN recovers by itself if things return to mormal, and
 * CAN bus states Error Passive and Bus Off are handled by handle_can_bus_state(). */
#define     ERROR_DIAG                  (0)   /* 1 on, 0 off. USE_CAN_POLL must be 0 if on. */

