district9prawn/rx72t-canbus-demo/src/demo/can_api_demo.c
/***********************************************************************************************************************
 * Exported global variables
************************************************************************************************************************/
/* Demo data */
can_frame_t  tx_dataframe, rx_dataframe, remote_frame;

/* RSK+ 64M uses CAN0 (channel 0). */
uint32_t    g_can_channel = CH_0;

/* CAN mailbox mode */
uint32_t    g_mb_mode = CANBOX_NORMAL; /* Normal mailbox */

/* CAN0 bitrate configure */
can_bitrate_config_t CAN0_bitrate_cfg;

/* Flags set by the CAN ISRs, so the user app knows it has data tp process.
 * Polled mode will poll the mailboxes instead. */
#if !USE_CAN_POLL
uint32_t    CAN0_tx_sentdata_flag = 0;
uint32_t    CAN0_rx_newdata_flag = 0;
uint32_t    CAN0_tx_remote_sentdata_flag = 0;
uint32_t    CAN0_rx_remote_frame_flag = 0;
#endif

/* Application layer logic error container. Use as desired to record issues. */
enum app_err_enum   app_err_nr;

/***********************************************************************************************************************
Global variables and functions imported (externs)
***********************************************************************************************************************/
/* Data */
/* Functions */
extern void   read_switches(void);
void R_CAN_PinSet_CAN0();

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
/* Errors. Peripheral and bus errors. Space for each channel. */
static uint32_t error_bus_status[NR_CAN_CHANNELS];
static uint32_t error_bus_status_prev[NR_CAN_CHANNELS];
static uint32_t can_state[NR_CAN_CHANNELS];
static uint32_t nr_times_reached_busoff[NR_CAN_CHANNELS];

/* Counts demo frames sent and received. */
static uint32_t nr_frames_rx = 0, nr_frames_tx = 0;

/* Functions */
static uint32_t init_can_app(void);
static void     check_can_errors(void);
static void     handle_can_bus_state(uint8_t ch_nr);
static void     test_leds(uint32_t nr_led_flashes);
static void     demo_output_ports_configure(void);

#if USE_CAN_POLL
 static void    can_poll_demo(void);
#else
 static void can_int_demo(void);
 static void my_can_tx0_callback(void);
 static void my_can_rx0_callback(void);
 static void my_can_err0_callback(void);
#endif

/***********************************************************************************************************************
Function name:  main
Parameters:     -
Returns:        -
Description:    Main Can API demo program. See top of file.
***********************************************************************************************************************/
void main(void)
{
    uint32_t  i, api_status = R_CAN_OK, bus_status, led_show_count;

    #if BSP_CFG_IO_LIB_ENABLE
        printf("\n\nStarting Tx-Rx Demo...\n");
        printf("R_CAN_Create() for channel %d, and provided user callback funcs.\n", g_can_channel);
    #endif

    demo_output_ports_configure();

    /* Blink LEDs. */
    test_leds(30);

    /* Config bitrate for CAN0*/
    CAN0_bitrate_cfg.BRP = CAN0_BRP;
    CAN0_bitrate_cfg.SJW = CAN0_SJW;
    CAN0_bitrate_cfg.TSEG1 = CAN0_TSEG1;
    CAN0_bitrate_cfg.TSEG2 = CAN0_TSEG2;

    /* Init CAN. */
    #if USE_CAN_POLL
        api_status = R_CAN_Create(g_can_channel, g_mb_mode, CAN0_bitrate_cfg, NULL, NULL, NULL, NULL, NULL);
    #else
        api_status = R_CAN_Create(g_can_channel, g_mb_mode, CAN0_bitrate_cfg, my_can_tx0_callback, NULL, my_can_rx0_callback, NULL, my_can_err0_callback);
    #endif

    if (api_status != R_CAN_OK)
    {
        /* An error at this stage is fatal to demo, so stop here. */
        #if BSP_CFG_IO_LIB_ENABLE
            printf("Demo init error.\n\n");
        #endif
        while (1)
        {
            /* Stop here and leave error displayed. */
        }
    }

    /****************************************
    * Pick ONE R_CAN_PortSet call below!    *
    *****************************************/
    /* Normal CAN bus usage. */
    R_CAN_PinSet_CAN0();
    /* Test modes. With Internal loopback mode you only need one board! */
    //api_status = R_CAN_PortSet(g_can_channel, ENABLE);
    api_status = R_CAN_PortSet(g_can_channel, CANPORT_TEST_1_INT_LOOPBACK);
    //api_status = R_CAN_PortSet(g_can_channel, CANPORT_TEST_0_EXT_LOOPBACK);
    //api_status = R_CAN_PortSet(g_can_channel, CANPORT_TEST_LISTEN_ONLY);

    /* Initialize CAN mailboxes, and setup the demo receive and transmit dataframe variables. */
    api_status |= init_can_app();

    /* Is all OK after all CAN initialization? */
    if (api_status != R_CAN_OK)
    {
        api_status = R_CAN_OK;
        app_err_nr = APP_ERR_CAN_INIT;
    }

    /***************************************************
     * Try to send very first frame. Stop if no success.
     ***************************************************/
    /* Shift to the operate mode */
    R_CAN_Control(g_can_channel, OPERATE_CANMODE);

    if (FRAME_ID_MODE == STD_ID_MODE )
    {
        api_status |= R_CAN_TxSet(g_can_channel, g_mb_mode, CANBOX_TX, &tx_dataframe, DATA_FRAME);
    }
    else
    {
        api_status |= R_CAN_TxSetXid(g_can_channel, g_mb_mode, CANBOX_TX, &tx_dataframe, DATA_FRAME);
    }

    /* Don't continue if problem already. */
    if (api_status != R_CAN_OK)
    {
        while(1)
            ;
    }

    /* Wait for first frame to be sent. */
    #if USE_CAN_POLL
    while (R_CAN_TxCheck(g_can_channel, CANBOX_TX))
    #else
    while (CAN0_tx_sentdata_flag == 0)
    #endif
    {
        /* If Bus Off, wait until cleared. If it never does, bus is broke. */
        bus_status = R_CAN_CheckErr(g_can_channel);
        while (bus_status == R_CAN_STATUS_BUSOFF)
        {
            bus_status = R_CAN_CheckErr(g_can_channel);
        }
    }
    /************************
     * OK!! Sent one frame! *
     ************************/
    #if BSP_CFG_IO_LIB_ENABLE
        printf("Success! Sent first CAN frame.\n");
    #endif

    /******************************************************************
     * Send multiple CAN test frames back to back as fast as possible.
     *****************************************************************/
    #if USE_CAN_POLL /* ============================================================= */
    for (i = 0; i < NR_STARTUP_TEST_FRAMES; i++)
    {
        api_status |= R_CAN_Tx(g_can_channel, g_mb_mode, CANBOX_TX);
        while (R_CAN_TxCheck(g_can_channel, CANBOX_TX))
        {
            R_BSP_NOP();
        }
    }
    #if BSP_CFG_IO_LIB_ENABLE
        printf("Sent %d CAN0 frames.\n", NR_STARTUP_TEST_FRAMES);
    #endif

