district9prawn/rx72t-canbus-demo/src/demo/can_api_demo.c
        /* Mask for receive box.
         * 0x7FF = no mask. 0x7FD = mask bit 1, for example; If receive ID is set to 1, both ID 1 and 3 should be received.
         * 0x00 = MASK ALL = receive all frames. */
        R_CAN_RxSetMask(g_can_channel, CANBOX_RX, 0x7FF);
    }
    else
    {
        api_status |= R_CAN_RxSetXid(g_can_channel, CANBOX_RX, RX_CANID_DEMO_INIT, DATA_FRAME);

        /* Mask for receive box.
         * 0x1FFFFFFF = no mask. 0x1FFFFFFD = mask bit 1, for example; If receive ID is set to 1, both
           ID 1 and 3 should be received. */
        R_CAN_RxSetMask( g_can_channel, CANBOX_RX, 0x1FFFFFFF);
    }

    /********Init. demo Tx dataframe RAM structure********
    Standard ID; choose value 0-0x07FF.
    Extended ID; choose value 0-0x1FFFFFFD. */
    tx_dataframe.id         = TX_CANID_DEMO_INIT;
    tx_dataframe.dlc        = 8;
    for (i = 0; i < 8; i++)
    {
        tx_dataframe.data[i]    = 0xff;
    }

    #if REMOTE_DEMO_ENABLE
    /*************** Init. remote dataframe response **********************/
    remote_frame.id = REMOTE_TEST_ID;

    /* Length is specified by the remote request. */

    /* Some data.. */
    for (i = 0; i < 8; i++)
    {
        remote_frame.data[i] = i;
    }

    /* Prepare mailbox for Tx. */
    if (FRAME_ID_MODE == STD_ID_MODE)
    {
        R_CAN_RxSet(g_can_channel, CANBOX_REMOTE_RX, REMOTE_TEST_ID, REMOTE_FRAME);
    }
    else
    {
        R_CAN_RxSetXid(g_can_channel, CANBOX_REMOTE_RX, REMOTE_TEST_ID, REMOTE_FRAME);
    }
    #endif
    /***********************************************************************/

    /* Set frame buffer id so trace shows correct receive ID from start. */
    rx_dataframe.id = RX_CANID_DEMO_INIT;

    app_err_nr |= APP_NO_ERR;

    return (api_status);
} /* end init_can_app */

/*****************************************************************************
Function Name:  check_can_errors
Parameters:     -
Returns:        -
Description:    Check for all possible errors, in app and peripheral. Add
                checking for your app here.
*****************************************************************************/
static void check_can_errors(void)
{
    /* Error passive or more? */
    handle_can_bus_state(g_can_channel);

    if (app_err_nr)
    {
        #if BSP_CFG_IO_LIB_ENABLE
            printf("Check CAN errors. app_err_nr = %d\n", app_err_nr);
        #endif

        app_err_nr = APP_NO_ERR;

        /* Show error to user */
        /* RESET ERRORs with SW1. */
        LED3 = LED_ON;  //RED LED
    }
}/* end check_can_errors() */

/*****************************************************************************
Function name:  handle_can_bus_state()
Parameters:     Bus number
Returns:        -
Description:    Check CAN peripheral bus state.
*****************************************************************************/
static void handle_can_bus_state(uint8_t ch_nr)
{
    /* Has the status register reached error passive or more? */
    if (ch_nr < NR_CAN_CHANNELS)
    {
        error_bus_status[ch_nr] = R_CAN_CheckErr(ch_nr);
    }
    else
    {
        return;
    }

    /* Tell user if CAN bus status changed.
       All Status bits are read only. */
    if (error_bus_status[ch_nr] != error_bus_status_prev[ch_nr])
    {
        switch (error_bus_status[ch_nr])
        {
            /* Error Active. */
            case R_CAN_STATUS_ERROR_ACTIVE:
                /* Only report if we recovered from Error Passive or Bus Off. */
                if (error_bus_status_prev[ch_nr] > R_CAN_STATUS_ERROR_ACTIVE)
                {
                    #if BSP_CFG_IO_LIB_ENABLE
                        printf("CAN channel %d R_CAN_STATUS_ERROR_ACTIVE\n\n", ch_nr);
                    #endif
                }
                /* Restart if returned from Bus Off. */
                if (error_bus_status_prev[ch_nr] == R_CAN_STATUS_BUSOFF)
                {
                    #if BSP_CFG_IO_LIB_ENABLE
                        printf("CAN channel %d returned from Bus Off. REINIT CAN PERIPHERAL.\n\n", ch_nr);
                    #endif

                    /* Restart CAN */
                    #if USE_CAN_POLL
                        if (R_CAN_Create(g_can_channel, g_mb_mode, CAN0_bitrate_cfg, NULL, NULL, NULL, NULL, NULL))
                    #else
                        if (R_CAN_Create(g_can_channel, g_mb_mode, CAN0_bitrate_cfg, my_can_tx0_callback, NULL, my_can_rx0_callback, NULL, my_can_err0_callback) != R_CAN_OK)
                    #endif

                    /* Restart CAN demos even if only one channel failed. */
                    init_can_app();
                }
                break;

            /* Error Passive. */
            case R_CAN_STATUS_ERROR_PASSIVE:
                #if BSP_CFG_IO_LIB_ENABLE
                    printf("CAN channel %d R_CAN_STATUS_ERROR_PASSIVE\n\n", ch_nr);
                #endif
                break;

            case R_CAN_STATUS_BUSOFF:
            default:
                nr_times_reached_busoff[ch_nr]++;
                #if BSP_CFG_IO_LIB_ENABLE
                    printf("CAN channel %d R_CAN_STATUS_BUSOFF\n\n", ch_nr);
                #endif
                break;
        }
        error_bus_status_prev[ch_nr] = error_bus_status[ch_nr];
    }
}/* end handle_can_bus_state() */

/*******************************************************************************
Function name:  reset_all_errors()
Description:    Reset all types of errors, application and CAN peripeheral errors.
Parameters:     g_can_channel   Channel number to reset.
Return value:   CAN API code
*******************************************************************************/
uint32_t reset_all_errors(uint8_t g_can_channel)
{
    uint32_t status = 0;

    /* Reset errors */
    app_err_nr = APP_NO_ERR;

    error_bus_status[0] = 0;
    error_bus_status[1] = 0;

    /* You can choose to not reset error_bus_status_prev; if there was an error,
    keep info to signal recovery */
    error_bus_status_prev[0] = 0;
    error_bus_status_prev[1] = 0;

